app/controllers/ranking_controller.rb

  def index
    @wechat_users = WechatUser.order(max_score: :desc).limit(10)
---
SELECT  "wechat_users".* FROM "wechat_users" ORDER BY "wechat_users"."max_score" DESC LIMIT ?  [["LIMIT", 10]]