app/controllers/wechat_users_controller.rb

  def create
    @wechat_user = WechatUser.find_or_create_by!(open_id: open_id)
---
INSERT INTO "wechat_users" ("open_id", "nickname", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @wechat_user = WechatUser.find_by(id: update_params['id'])
    if @wechat_user.max_score < update_params['max_score']
      @wechat_user.update(max_score: update_params['max_score'])
---
UPDATE "wechat_users" SET "max_score" = ?, "updated_at" = ? WHERE "wechat_users"."id" = ?  [["max_score", 100], ["updated_at", "2018-05-04 16:13:44.400235"], ["id", 1]]